In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Delhi.csv')
data['price'] = data['price'] / 100000

In [3]:
data.head()

   price  sqft          location  bathrooms  bhk            area_type
0  105.0  1200  Sector 10 Dwarka        2.0    1  Super built-up Area
1   60.0  1000       Uttam Nagar        5.0    3            Plot Area
2  150.0  1350      Sarita Vihar        2.0    3        Built-up Area
3   25.0   435       Uttam Nagar        3.0    2  Super built-up Area
4   58.0   900        Dwarka Mor        2.0    4  Super built-up Area

In [4]:
data.shape

(4998, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4998 entries, 0 to 4997
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      4998 non-null   float64
 1   sqft       4998 non-null   int64
 2   location   4998 non-null   object
 3   bathrooms  4966 non-null   float64
 4   bhk        4998 non-null   int64
 5   area_type  4998 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 234.4+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

25.00000      116
24.00000       91
35.00000       89
155.00000      89
30.00000       88
             ...
615.00000       1
4190.99999      1
45.50000        1
76.00000        1
1250.00000      1
Name: price, Length: 724, dtype: int64
********************
800     575
1000    439
1800    262
900     218
750     124
       ...
1869      1
1825      1
1821      1
1809      1
2031      1
Name: sqft, Length: 454, dtype: int64
********************
Noida                      761
Uttam Nagar                430
Dwarka Mor                 347
Vasant Kunj                263
Burari                     144
                          ...
Ramesh Nagar                 1
1 Lane Johri Farm            1
Sector 8 Dwarka Block B      1
Mathura Road                 1
Hauz Khas Enclave            1
Name: location, Length: 339, dtype: int64
********************
2.0     2581
3.0     1253
4.0      462
1.0      280
5.0      187
6.0       91
7.0       50
9.0       23
8.0       21
10.0       7
12.0       3
11.0       2
16.0       2
15.0       1
27.0       1
40.0       1
14.0       1
Name: bathrooms, dtype: int64
********************
3     2222
2     1579
4      585
1      492
5       61
6       26
7       11
8        8
9        7
10       4
16       1
13       1
11       1
Name: bhk, dtype: int64
********************
Super built-up Area    3279
Built-up Area           902
Plot Area               777
Carpet Area              40
Name: area_type, dtype: int64
********************

In [7]:
data.isna().sum()

price         0
sqft          0
location      0
bathrooms    32
bhk           0
area_type     0
dtype: int64

In [8]:
data.describe()

             price          sqft    bathrooms          bhk
count  4998.000000   4998.000000  4966.000000  4998.000000
mean    158.863837   1277.343737     2.720701     2.681273
std     461.289394    915.217800     1.471968     1.025907
min      20.000000    200.000000     1.000000     1.000000
25%      29.000000    800.000000     2.000000     2.000000
50%      55.000000   1000.000000     2.000000     3.000000
75%     158.000000   1650.000000     3.000000     3.000000
max    8545.999990  16000.000000    40.000000    16.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4998 entries, 0 to 4997
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      4998 non-null   float64
 1   sqft       4998 non-null   int64
 2   location   4998 non-null   object
 3   bathrooms  4966 non-null   float64
 4   bhk        4998 non-null   int64
 5   area_type  4998 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 234.4+ KB

In [10]:
data['location'].value_counts()

Noida                      761
Uttam Nagar                430
Dwarka Mor                 347
Vasant Kunj                263
Burari                     144
                          ...
Ramesh Nagar                 1
1 Lane Johri Farm            1
Sector 8 Dwarka Block B      1
Mathura Road                 1
Hauz Khas Enclave            1
Name: location, Length: 339, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Dwarka Mor')

In [12]:
data['bhk'].value_counts()

3     2222
2     1579
4      585
1      492
5       61
6       26
7       11
8        8
9        7
10       4
16       1
13       1
11       1
Name: bhk, dtype: int64

In [13]:
data['bhk'] = data['bhk'].fillna('2')

In [14]:
data['bathrooms'] = data['bathrooms'].fillna(data['bathrooms'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4998 entries, 0 to 4997
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      4998 non-null   float64
 1   sqft       4998 non-null   int64
 2   location   4998 non-null   object
 3   bathrooms  4998 non-null   float64
 4   bhk        4998 non-null   int64
 5   area_type  4998 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 234.4+ KB

In [16]:
data[data.bhk > 20]

Empty DataFrame
Columns: [price, sqft, location, bathrooms, bhk, area_type]
Index: []

In [17]:
data['sqft'].unique()

array([ 1200,  1000,  1350,   435,   900,  1800,  1500,  1300,  1550,
         600,   385,  2500,  1050,  1600,   630,  2000,  1125,   415,
         675,  1750,  4600,  1650,   540,   950,   850,   450,  1551,
         650,   550,  1843,  3000,  1700,   700,   750,   810,  1250,
        3800,   380,  2250,   645,   920,   570,  6400,  1100,   800,
         500,   620,   581,  2150,  2350,   720,   990,   765,  1950,
         410,  1450,  1400,  1150,  1900,   820,   625,   525,  2200,
        2400,  2300,  2100,  2600,   360,   400,  2800,  1170,   638,
         954,   774,   495,   738,  1080,   517,   864,   612,   558,
         585,   567,   875,   756,  4500,   855,  2700,   980,   580,
        1850,  2050,  3500,  1880,  4200,   680,  1485,   480,   350,
        1375,   740,   477,   865,   640,   685,   520,   658,  1638,
         616,   505,   667,   510,   861,   755,   760,  2520,  1440,
        1055,   970,   545,   615,  1215,  2001,   785,  2302,  1245,
        3200,  1530,  3300,   560,   830,   300,   610,   770,  1105,
        2650,  2750,   220,   200,   210,   531,  3260,  3450,  2160,
        2850,  1160,   818,   845,  1475,   833,   799,  1030,  1025,
        1035,  1565,  2550,  1560,   562,   549,  1953,  1963,  1711,
        1699,  1321,  1599,  5500,  1858,   590,   465,  2870,   516,
         530,   594,   565,  1680,  7254,  1658,  2450,  4966,  5000,
        4000,  2402,  6976,  2311,  3250,   521,  1435,  1801,  6815,
        7049,  5422,  6650,  5503,  4350,  6877,  7500,  7251,  6905,
        1017,  1337,   518,  1381,  2799,   460,   420,   883,  1855,
        2025,  1758,  1582,   668,  4580,   975,  1625,  1204,  2590,
        3600,  1114,  1821,  2741,  2530,  1845,  1930,   945,  5412,
         972,  1869,  2798,  2369, 16000,  2210,  2900,  1333,  1894,
        1904,  4430,  1420,  1906,  1886,  2863,  5621,  5211,  2202,
        1501,  1854,   426,  4503,  1872,  1504,   405,  2448,  2580,
        5175,  2430,  1115,  1075,  1387,   422,  4506,  3015,  1620,
         440,  5625,  1503,  6521,  3123,  2322,  1206,  2106,  1006,
        1040,  1175,   459,   918,   504,   780,   909,   790,   556,
        4502,  4501,  1980,  2754,  1957,  1888,  1255,  1999,  2555,
        2666,  2380,  2305,  3240,  2070,  2645,  2011,  7211, 12552,
        8521,  5523,  4950,  1251,   952,  1106,  1615,  2475,  1194,
        1097,  2790,  1905,  1180,   725,  1827,  1401,  1510,  1103,
         407,  6852,  4521,  1002,  3006,  1201,  2537,  7000,  1260,
        4400,   401,   507,   890,  1996,   730,   811,  6975,  1007,
        1875,  1835,  1585,  2970,  1490,  1264,  2395,  1751,  1732,
        2725,  2639,  1825,  1076,   532,  2075,  1931,  3715,  1256,
         632,  2195,  1240,  7259,  8000,  5550,  1470,  1674,  1044,
        7411,  1429,  2833,  1210,  1360,  1406,  5200,  1188,  9000,
        3650,  1647,  1690,   648,  1935,  1653,  1386,   801,   690,
        1005,  4376,  5582,  1225,  2360,  1020,  1107,  1207,  1498,
        1965,   586,   240,  1537,  1709,  2911,  1442,   677,  1143,
        2340,  2111,  6541,  1197,   605,  2808,  6544,  1610,  1629,
        1102,  1101,  1728,  1323,  1422,   927,  3460,  3850,  4300,
         710,  1786,   979,  2234,  2020,   981,  1152,  1809,  6251,
        3652,  1269,  1089,  2021,  2341,  2010,  3375,  2140,  1784,
        1881,  4504,   888,  1651,  1053,  1134,  1415,   965,  1223,
        4010,  2320,  2423,   978,   704,   572,  1220,  2412,  2620,
        1190,  2312,  2031,  1275], dtype=int64)

In [18]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:
data.head()

   price  sqft          location  bathrooms  bhk            area_type
0  105.0  1200  Sector 10 Dwarka        2.0    1  Super built-up Area
1   60.0  1000       Uttam Nagar        5.0    3            Plot Area
2  150.0  1350      Sarita Vihar        2.0    3        Built-up Area
3   25.0   435       Uttam Nagar        3.0    2  Super built-up Area
4   58.0   900        Dwarka Mor        2.0    4  Super built-up Area

# Price Per Square Feet

In [20]:
data['location'].value_counts()

Noida                      761
Uttam Nagar                430
Dwarka Mor                 347
Vasant Kunj                263
Burari                     144
                          ...
Ramesh Nagar                 1
1 Lane Johri Farm            1
Sector 8 Dwarka Block B      1
Mathura Road                 1
Hauz Khas Enclave            1
Name: location, Length: 339, dtype: int64

In [21]:
data['location'] = data['location'].apply(lambda x: x.strip())

In [22]:
data['location']

0       Sector 10 Dwarka
1            Uttam Nagar
2           Sarita Vihar
3            Uttam Nagar
4             Dwarka Mor
              ...
4993         Madhu Vihar
4994         Madhu Vihar
4995    Sector 26 Dwarka
4996    Sector 26 Dwarka
4997         Uttam Nagar
Name: location, Length: 4998, dtype: object

In [23]:
location_count = data['location'].value_counts()

In [24]:
location_count

Noida                      761
Uttam Nagar                430
Dwarka Mor                 347
Vasant Kunj                263
Burari                     144
                          ...
Ramesh Nagar                 1
1 Lane Johri Farm            1
Sector 8 Dwarka Block B      1
Mathura Road                 1
Hauz Khas Enclave            1
Name: location, Length: 339, dtype: int64

In [25]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

CVD Line                   10
Kundli                     10
Sector 9 Rohini            10
Sheikh Sarai               10
Hauz Khas                   9
                           ..
Ramesh Nagar                1
1 Lane Johri Farm           1
Sector 8 Dwarka Block B     1
Mathura Road                1
Hauz Khas Enclave           1
Name: location, Length: 266, dtype: int64

In [26]:
data['location'] = data['location'].apply(lambda x: 'Other' if x in location_count_less_10 else x)

In [27]:
data['location'].value_counts()

Noida                 761
Other                 589
Uttam Nagar           430
Dwarka Mor            347
Vasant Kunj           263
                     ...
Shanti Park Dwarka     13
Roop Nagar             12
Model Town             12
Punjabi Bagh           12
Sector 17 Dwarka       11
Name: location, Length: 74, dtype: int64

# Outliers Detection and Removal

In [28]:
(data['sqft'] / data['bhk']).describe()

count     4998.000000
mean       559.001349
std        531.995064
min         50.000000
25%        266.666667
50%        400.000000
75%        666.666667
max      16000.000000
dtype: float64

In [29]:
data = data[((data['sqft']/data['bhk']) >= 300)]
data.describe()

             price          sqft    bathrooms          bhk
count  3514.000000   3514.000000  3514.000000  3514.000000
mean    195.180760   1517.317871     2.736483     2.402106
std     526.043082    989.060901     1.513012     0.845750
min      20.000000    400.000000     1.000000     1.000000
25%      35.000000    990.000000     2.000000     2.000000
50%     111.500000   1300.000000     2.000000     2.000000
75%     173.750000   1800.000000     3.000000     3.000000
max    8545.999990  16000.000000    40.000000     7.000000

In [30]:
data.shape

(3514, 6)

In [31]:
data.price.describe()

count    3514.000000
mean      195.180760
std       526.043082
min        20.000000
25%        35.000000
50%       111.500000
75%       173.750000
max      8545.999990
Name: price, dtype: float64

In [32]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price)
        st = np.std(subdf.price)
        gen_df = subdf[(subdf.price > (m-st)) & (subdf.price <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

             price          sqft    bathrooms          bhk
count  3141.000000   3141.000000  3141.000000  3141.000000
mean    122.956861   1461.273798     2.714104     2.396371
std     135.086531    866.395317     1.358069     0.841881
min      20.000000    400.000000     1.000000     1.000000
25%      33.000000    952.000000     2.000000     2.000000
50%     107.000000   1250.000000     2.000000     2.000000
75%     165.000000   1800.000000     3.000000     3.000000
max    2350.000000  16000.000000    16.000000     6.000000

In [33]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price),
                'std': np.std(bhk_df.price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [34]:
data = bhk_outlier_remover(data)

In [35]:
data.shape

(1957, 6)

In [36]:
data

       price  sqft   location  bathrooms  bhk            area_type
3     190.00  1450  Alaknanda        4.0    4  Super built-up Area
4     190.00  1450  Alaknanda        3.0    3  Super built-up Area
7     187.00  1450  Alaknanda        1.0    4  Super built-up Area
8     183.00  1400  Alaknanda        1.0    3  Super built-up Area
12    185.00  1450  Alaknanda        5.0    4            Plot Area
...      ...   ...        ...        ...  ...                  ...
3136   47.00   810     nawada        2.0    1        Built-up Area
3137   44.00   800     nawada        2.0    2  Super built-up Area
3138   45.00   900     nawada        3.0    2        Built-up Area
3139   51.00   900     nawada        7.0    2            Plot Area
3140   49.99   600     nawada        2.0    2        Built-up Area

[1957 rows x 6 columns]

# Cleaned Data

In [37]:
data.drop(columns=['area_type'],inplace=True)
data.head()

    price  sqft   location  bathrooms  bhk
3   190.0  1450  Alaknanda        4.0    4
4   190.0  1450  Alaknanda        3.0    3
7   187.0  1450  Alaknanda        1.0    4
8   183.0  1400  Alaknanda        1.0    3
12  185.0  1450  Alaknanda        5.0    4

In [38]:
data.to_csv("Delhi_Cleaned_data.csv")

In [39]:
X = data.drop(columns=['price'])
y = data['price']

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [41]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [42]:
print(X_train.shape)
print(X_test.shape)

(1565, 4)
(392, 4)

# Applying Linear Regression

In [43]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [44]:
scaler = StandardScaler()

In [45]:
lr = LinearRegression(normalize=True)

In [46]:
pipe = make_pipeline(column_trans,scaler,lr)

In [47]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [48]:
y_pred_lr = pipe.predict(X_test)

In [49]:
r2_score(y_test, y_pred_lr)

0.3074397601872222

# Applying Lasso

In [50]:
lasso = Lasso()

In [51]:
pipe = make_pipeline(column_trans, scaler, lasso)

In [52]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [53]:
y_pred_lasso = pipe.predict(X_test)

In [54]:
r2_score(y_test, y_pred_lasso)

0.3085574350220004

# Applying Ridge

In [55]:
ridge = Ridge()

In [56]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [58]:
y_pred_ridge = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred_ridge)

0.30710662402483324

In [60]:
print("Linear Regression: ", r2_score(y_test, y_pred_lr))
print("Lasso: ", r2_score(y_test, y_pred_lasso))
print("Ridge: ", r2_score(y_test, y_pred_ridge))

Linear Regression:  0.3074397601872222
Lasso:  0.3085574350220004
Ridge:  0.30710662402483324

In [61]:
import pickle

In [62]:
pickle.dump(pipe, open('DelhiRidgeModel.pkl', 'wb'))